# 7
# Идея с тройным вложенным циклом верная, но то что написано внутри range - так не надо, у тебя конкретно 4 числа на выбор на каждую позицию
# Возможно я забыл написать - числа могут повторяться внутри комбинации, то есть 1 1 1 1 - валидно
a = int(input())

count = 0

# i = 1, j = 1, k = 1
# i = 1, j = 1, k = 2
# i = 1, j = 1, k = 3
# i = 1, j = 1, k = 4

# i = 1, j = 2, k = 1
# i = 1, j = 2, k = 2
# i = 1, j = 2, k = 3
# i = 1, j = 2, k = 4

# i = 1, j = 3, k = 1
# i = 1, j = 3, k = 2
# i = 1, j = 3, k = 3
# i = 1, j = 3, k = 4

# i = 1, j = 4, k = 1
# i = 1, j = 4, k = 2
# i = 1, j = 4, k = 3
# i = 1, j = 4, k = 4

# i = 2, j = 1, k = 1
# i = 2, j = 1, k = 2
# i = 2, j = 1, k = 3
# i = 2, j = 1, k = 4

# i = 1, j = 2, k = 1
# i = 1, j = 2, k = 2
# i = 1, j = 2, k = 3
# i = 1, j = 2, k = 4

# i = 1, j = 3, k = 1
# i = 1, j = 3, k = 2
# i = 1, j = 3, k = 3
# i = 1, j = 3, k = 4

# i = 1, j = 4, k = 1
# i = 1, j = 4, k = 2
# i = 1, j = 4, k = 3
# i = 1, j = 4, k = 4

for i in range(1, 5):
    for j in range(1, 5):
        for k in range(1, 5):
            print(i, j, k)
            if i + j + k == a:
                count == 1
print(count)